#+TITLE: Cypher Property Graph Query Language Demo with Neo4j
* Creating graphs

- the =CREATE= statement creates new nodes and edges. A single create statement can create multiple nodes and edges. The statement is finished with =;=.

The syntax for creating a node is:

#+begin_src cypher :password neopren :results none
CREATE (nodeid:label { propertynameOne:'value1', ..., propertynameN:'valueN' });
#+end_src

Note that node ids are only valid within the scope of a single statement.

To create an edge:
#+begin_src cypher :password neopren :results none
CREATE (nodeidOne)-[:EDGE_LABEL] { propertynameOne:'value1', ..., propertynameN:'valueN' }->(nodeidTwo)
#+end_src

#+BEGIN_SRC cypher :password neopren
CREATE (matrix1:Movie { title : 'The Matrix', year : '1999-03-31' })
CREATE (matrix2:Movie { title : 'The Matrix Reloaded', year : '2003-05-07' })
CREATE (matrix3:Movie { title : 'The Matrix Revolutions', year : '2003-10-27' })
CREATE (keanu:Actor { name:'Keanu Reeves' })
CREATE (laurence:Actor { name:'Laurence Fishburne' })
CREATE (carrieanne:Actor { name:'Carrie-Anne Moss' })
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]->(matrix1)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]->(matrix2)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]->(matrix3)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]->(matrix1)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]->(matrix2)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]->(matrix3)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]->(matrix1)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]->(matrix2)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]->(matrix3)
#+END_SRC

#+RESULTS:
|---|

**** Returning tables

 - when only properties are selected in the =RETURN= clause then the result is a table

 - Let us return the name of actors that acted in some movie

 #+BEGIN_SRC cypher :password neopren :results raw
match (actor)-[r:ACTS_IN]->(movie)
return actor.name
 #+END_SRC

 #+RESULTS:
 | actor.name         |
 |--------------------|
 | Keanu Reeves       |
 | Keanu Reeves       |
 | Keanu Reeves       |
 | Laurence Fishburne |
 | Laurence Fishburne |
 | Laurence Fishburne |
 | Carrie-Anne Moss   |
 | Carrie-Anne Moss   |
 | Carrie-Anne Moss   |

 - or the names of actors and the titles of movies they starred in and what their role was

 #+BEGIN_SRC cypher :password neopren :results raw
MATCH (actor)-[r:ACTS_IN]->(movie)
RETURN actor.name, r.role, movie.title
 #+END_SRC

 #+RESULTS:
 | actor.name         | r.role   | movie.title            |
 |--------------------+----------+------------------------|
 | Keanu Reeves       | Neo      | The Matrix Revolutions |
 | Keanu Reeves       | Neo      | The Matrix Reloaded    |
 | Keanu Reeves       | Neo      | The Matrix             |
 | Laurence Fishburne | Morpheus | The Matrix Revolutions |
 | Laurence Fishburne | Morpheus | The Matrix Reloaded    |
 | Laurence Fishburne | Morpheus | The Matrix             |
 | Carrie-Anne Moss   | Trinity  | The Matrix Revolutions |
 | Carrie-Anne Moss   | Trinity  | The Matrix Reloaded    |
 | Carrie-Anne Moss   | Trinity  | The Matrix             |


 # Local Variables:
 # org-image-actual-width: 800
 # End:

